{
    "webDevelopment": [
      {
        "subservice": "Responsive Website Development",
        "description": "We build responsive websites that deliver a seamless experience across all devices. Our development process focuses on clean design, user-friendly interfaces, and fast loading times to ensure your online presence is both attractive and functional.",
        "techStack": ["HTML5", "CSS3", "JavaScript", "Bootstrap", "React"]
      },
      {
        "subservice": "E-commerce Development",
        "description": "Our e-commerce solutions are designed to boost your online sales. We integrate secure payment gateways, intuitive navigation, and scalable architecture to create stores that not only attract customers but also convert visits into revenue.",
        "techStack": ["Shopify", "WooCommerce", "Magento", "PHP", "JavaScript"]
      },
      {
        "subservice": "Custom Web Applications",
        "description": "From concept to deployment, we develop custom web applications tailored to your business needs. Our solutions are robust, scalable, and designed to integrate seamlessly with your existing systems.",
        "techStack": ["Node.js", "Python", "Ruby on Rails", "Angular", "Vue.js"]
      },
      {
        "subservice": "Web Maintenance & Optimization",
        "description": "We offer ongoing support and optimization to ensure your website remains secure, up-to-date, and performing at its best. Our proactive maintenance service minimizes downtime and keeps your online presence competitive.",
        "techStack": ["WordPress", "Joomla", "Git", "Google Analytics", "SEO Tools"]
      }
    ],
    "mobileApps": [
      {
        "subservice": "Native App Development",
        "description": "We create high-performance native mobile apps that deliver superior user experiences. Our native development services focus on leveraging the full potential of the mobile platform for optimized performance.",
        "techStack": ["Swift", "Kotlin", "Objective-C", "Java"]
      },
      {
        "subservice": "Cross-Platform App Development",
        "description": "Our cross-platform solutions enable you to reach a wider audience without compromising on performance. We build apps that work flawlessly on both iOS and Android, reducing development time and cost.",
        "techStack": ["React Native", "Flutter", "Xamarin", "Ionic"]
      },
      {
        "subservice": "Mobile App UI/UX Design",
        "description": "A great app starts with an intuitive design. We focus on crafting engaging and user-friendly interfaces that enhance the mobile experience, ensuring your app stands out in today’s competitive market.",
        "techStack": ["Sketch", "Figma", "Adobe XD", "InVision"]
      },
      {
        "subservice": "Mobile App Maintenance & Support",
        "description": "Our maintenance and support services keep your mobile app updated, secure, and performing at its peak. We provide regular updates, bug fixes, and feature enhancements to ensure continuous improvement.",
        "techStack": ["Firebase", "Crashlytics", "AppCenter", "JIRA"]
      }
    ],
    "marketingVideo": {
      "explainerVideoAnimation": {
        "description": "Our explainer video animation service simplifies complex ideas through engaging narratives and dynamic visuals. Perfect for introducing products, explaining services, or educating audiences, these videos capture attention and drive conversions.",
        "techStack": ["Adobe After Effects", "Premiere Pro", "Toonly"]
      },
      "2dAnimation": {
        "description": "Our 2D animation service brings stories to life with vibrant illustrations and smooth transitions. Ideal for ads, social media content, and educational videos, we deliver creative visuals that resonate with your audience.",
        "techStack": ["Adobe Animate", "After Effects", "Toon Boom Harmony"]
      },
      "3dAnimation": {
        "description": "We craft immersive 3D animations that add depth and realism to your marketing campaigns. Perfect for product visualizations, architectural renderings, and cinematic presentations, our 3D animations captivate and inform.",
        "techStack": ["Cinema 4D", "Blender", "Maya"]
      },
      "whiteboardAnimation": {
        "description": "Our whiteboard animation service uses hand-drawn illustrations to tell your brand’s story in a clear, engaging way. This technique is perfect for educational content and process explanations, making complex ideas accessible.",
        "techStack": ["VideoScribe", "Explaindio", "After Effects"]
      },
      "customDigitalLogoAnimation": {
        "description": "Transform your brand identity with our custom digital logo animation. We animate your logo to create dynamic visuals for intros, presentations, and online content, reinforcing brand recognition and adding a professional touch.",
        "techStack": ["Adobe After Effects", "Cinema 4D", "Blender"]
      }
    },
    "brandingCreativeDesign": [
      {
        "subservice": "Logo & Identity Design",
        "description": "Craft a memorable visual identity with our custom logo and branding solutions. We create unique logos and brand assets that reflect your business’s personality and values, ensuring consistency across all platforms.",
        "techStack": ["Adobe Illustrator", "Photoshop", "CorelDRAW"]
      },
      {
        "subservice": "Brand Strategy & Messaging",
        "description": "Our strategic branding services help define your core message and market positioning. We work closely with you to develop a brand strategy that resonates with your audience and supports long-term growth.",
        "techStack": ["Canva", "Miro", "Brandwatch"]
      },
      {
        "subservice": "Print & Digital Collateral",
        "description": "From business cards to social media graphics, our design services cover all your print and digital collateral needs. We ensure every piece of material is aligned with your brand identity and delivers a cohesive message.",
        "techStack": ["Adobe InDesign", "Photoshop", "Illustrator"]
      },
      {
        "subservice": "Packaging & Merchandise Design",
        "description": "Stand out on the shelf with innovative packaging and merchandise designs. We combine creativity with functionality to develop packaging that not only protects your product but also tells your brand story.",
        "techStack": ["Adobe Illustrator", "Photoshop", "3D Studio Max"]
      }
    ]
  }
  